0.1.0/tutorials/incompressible/simple/air_foil_2d/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (25.75 3.62 0);

boundaryField
{
  inlet
  {
    type            freestream;
    freestreamValue uniform (25.75 3.62 0);
  }
  outlet
  {
    type            freestream;
    freestreamValue uniform (25.75 3.62 0);
  }
  walls
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
