0.1.0/tutorials/incompressible/simple/air_foil_2d/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss linearUpwind grad(U);
  div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}
wallDist
{
  method meshWave;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
